<?php


use Illuminate\Database\Seeder;
use App\Models\Tenant\Product_style;

class ProductStylesTableSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    /**
     * ลักษณะสินค้า.
     */

    $data = [
      'กระจก', 'กระเบิ้อง', 'กระเบื้อง', 'กาแฟ', 'แก๊ส', 'ข้าว', 'ข้าวโพด',
      'คอนกรีตผสมเสร็จ', 'เครื่องใช้ไฟฟ้า', 'เครื่องดื่ม', 'เครื่องนุ่งห่ม', 'เครื่องสำอาง',
      'ชิ้นส่วนยานยนต์', 'ดอกไม้', 'ถุง', 'ทราย/กรวด/ดิน', 'น้ำตาล', 'ปาล์ม',
      'ปุ๋ย', 'ปูนซีเมนต์', 'ผลผลิตทางการเกษตรอื่นๆ', 'ผลไม้', 'ผลิตภัณฑ์จากโลหะ',
      'ผลิตภัณฑ์ปิโตรเลียม', 'ผลิตภัณฑ์อุตสาหกรรม', 'ผัก',
      'เฟอร์นิเจอร์', 'มันสำปะหลัง', 'ไม้ ไม้ซุง ท่อนไม้', 'ยา', 'ยาง', 'แร่ สินแร่ และกากโลหะ',
      'แร่ สินแร่ในหมวดเชื้อเพลิง', 'วัตถุขนาดใหญ่', 'วัตถุอันตรายอื่นๆ', 'วัสดุก่อสร้างและแร่อื่นๆ',
      'วัสดุก่อสร้างอื่นๆ', 'วัสดุเหลือใช้การเกษตร', 'สัตว์มีชีวิต', 'สารเคมี', 'สินค้าทั่วไปอื่นๆ',
      'สินค้าเบ็ดเตล็ดและบรรจุภัณฑ์', 'สินค้าอิเล็กทรอนิกส์', 'เหล็ก', 'อ้อย',
      'อาหารแช่แข็ง', 'อาหารสด', 'อาหารสัตว์', 'อุปกรณ์ เครื่องมือ และวัสดุอุตสาหกรรม'
    ];


    foreach ($data as $data_productstype) {
      $product_style = new Product_style();
      $product_style->name = $data_productstype;
      $product_style->save();
    }
  }
}
