<?php


use Illuminate\Database\Seeder;
use App\Models\Tenant\Province;


class ProvincesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /**
         * จังหวัด.
         */

        $data = [
            "กระบี่",
            "กรุงเทพมหานคร",
            "กาญจนบุรี",
            "กาฬสินธุ์",
            "กำแพงเพชร",
            "ขอนแก่น",
            "จันทบุรี",
            "ฉะเชิงเทรา",
            "ชลบุรี",
            "ชัยนาท",
            "ชัยภูมิ",
            "ชุมพร",
            "ตรัง",
            "ตราด",
            "ตาก",
            "นครนายก",
            "นครปฐม",
            "นครพนม",
            "นครราชสีมา",
            "นครศรีธรรมราช",
            "นครสวรรค์",
            "นนทบุรี",
            "นราธิวาส",
            "น่าน",
            "บึงกาฬ",
            "บุรีรัมย์",
            "ปทุมธานี",
            "ประจวบคีรีขันธ์",
            "ปราจีนบุรี",
            "ปัตตานี",
            "พระนครศรีอยุธยา",
            "พะเยา",
            "พังงา",
            "พัทลุง",
            "พิจิตร",
            "พิษณุโลก",
            "ภูเก็ต",
            "มหาสารคาม",
            "มุกดาหาร",
            "ยะลา",
            "ยโสธร",
            "ระนอง",
            "ระยอง",
            "ราชบุรี",
            "ร้อยเอ็ด",
            "ลพบุรี",
            "ลำปาง",
            "ลำพูน",
            "ศรีสะเกษ",
            "สกลนคร",
            "สงขลา",
            "สตูล",
            "สมุทรปราการ",
            "สมุทรสงคราม",
            "สมุทรสาคร",
            "สระบุรี",
            "สระแก้ว",
            "สิงห์บุรี",
            "สุพรรณบุรี",
            "สุราษฎร์ธานี",
            "สุรินทร์",
            "สุโขทัย",
            "หนองคาย",
            "หนองบัวลำภู",
            "อำนาจเจริญ",
            "อุดรธานี",
            "อุตรดิตถ์",
            "อุทัยธานี",
            "อุบลราชธานี",
            "อ่างทอง",
            "เชียงราย",
            "เชียงใหม่",
            "เพชรบุรี",
            "เพชรบูรณ์",
            "เลย",
            "แพร่",
            "แม่ฮ่องสอน",

        ];

        foreach ($data as $data_province) {
            $province = new Province();
            $province->name = $data_province;
            $province->save();
        }
    }
}
